Masmiseim36/nxpSDK/devices/MKM34ZA5/MKM34ZA5.xml
        <register>
          <name>SEL11</name>
          <description>Crossbar Select Register 11</description>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL22</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT22 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000000</name>
                  <description>Logic 1 (VDD)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001</name>
                  <description>Logic 0 (VSS)</description>
                  <value>#1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000010</name>
                  <description>AFE modulator clock output</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000011</name>
                  <description>AFE modulator data output</description>
                  <value>#11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000100</name>
                  <description>LPTimer Output</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000101</name>
                  <description>Clock Output</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000110</name>
                  <description>Quad Timer channel 0 output</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000111</name>
                  <description>Quad Timer channel 1 output</description>
                  <value>#111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001000</name>
                  <description>Quad Timer channel 2 output</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001001</name>
                  <description>Quad Timer channel 3 output</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001010</name>
                  <description>iRTC Clock Output</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001011</name>
                  <description>CMP0 Output</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001100</name>
                  <description>CMP1 Output</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001101</name>
                  <description>iRTC Alarm Output</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001110</name>
                  <description>UART TX Output (after modulation)</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001111</name>
                  <description>EWM Output (EWM_OUT)</description>
                  <value>#1111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010000</name>
                  <description>PIT Output</description>
                  <value>#10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010001</name>
                  <description>XBAR Input pin 0</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010010</name>
                  <description>XBAR Input pin 1</description>
                  <value>#10010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010011</name>
                  <description>XBAR Input pin 2</description>
                  <value>#10011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010100</name>
                  <description>XBAR Input pin 3</description>
                  <value>#10100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010101</name>
                  <description>XBAR Input pin 4</description>
                  <value>#10101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010110</name>
                  <description>XBAR Input pin 5</description>
                  <value>#10110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010111</name>
                  <description>XBAR Input pin 6</description>
                  <value>#10111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011000</name>
                  <description>XBAR Input pin 7</description>
                  <value>#11000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011001</name>
                  <description>XBAR Input pin 8</description>
                  <value>#11001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011010</name>
                  <description>ORed conversion complete flag for all SAR ADC channels</description>
                  <value>#11010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011011</name>
                  <description>ORed conversion complete flag for all AFE channels</description>
                  <value>#11011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011100</name>
                  <description>AFE Channel 0 conversion complete</description>
                  <value>#11100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011101</name>
                  <description>AFE Channel 1 conversion complete</description>
                  <value>#11101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011110</name>
                  <description>AFE Channel 2 conversion complete</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011111</name>
                  <description>AFE Channel 3 conversion complete</description>
                  <value>#11111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100000</name>
                  <description>DMA Done Signal</description>
                  <value>#100000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL23</name>
              <description>Input (XBAR_INn) to be muxed to XBAR_OUT23 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000000</name>
                  <description>Logic 1 (VDD)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001</name>
                  <description>Logic 0 (VSS)</description>
                  <value>#1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000010</name>
                  <description>AFE modulator clock output</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000011</name>
                  <description>AFE modulator data output</description>
                  <value>#11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000100</name>
                  <description>LPTimer Output</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000101</name>
                  <description>Clock Output</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000110</name>
                  <description>Quad Timer channel 0 output</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000111</name>
                  <description>Quad Timer channel 1 output</description>
                  <value>#111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001000</name>
                  <description>Quad Timer channel 2 output</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001001</name>
                  <description>Quad Timer channel 3 output</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001010</name>
                  <description>iRTC Clock Output</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001011</name>
                  <description>CMP0 Output</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001100</name>
                  <description>CMP1 Output</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001101</name>
                  <description>iRTC Alarm Output</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001110</name>
                  <description>UART TX Output (after modulation)</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001111</name>
                  <description>EWM Output (EWM_OUT)</description>
                  <value>#1111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010000</name>
                  <description>PIT Output</description>
                  <value>#10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010001</name>
                  <description>XBAR Input pin 0</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010010</name>
                  <description>XBAR Input pin 1</description>
                  <value>#10010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010011</name>
                  <description>XBAR Input pin 2</description>
                  <value>#10011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010100</name>
                  <description>XBAR Input pin 3</description>
                  <value>#10100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010101</name>
                  <description>XBAR Input pin 4</description>
                  <value>#10101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010110</name>
                  <description>XBAR Input pin 5</description>
                  <value>#10110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010111</name>
                  <description>XBAR Input pin 6</description>
                  <value>#10111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011000</name>
                  <description>XBAR Input pin 7</description>
                  <value>#11000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011001</name>
                  <description>XBAR Input pin 8</description>
                  <value>#11001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011010</name>
                  <description>ORed conversion complete flag for all SAR ADC channels</description>
                  <value>#11010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011011</name>
                  <description>ORed conversion complete flag for all AFE channels</description>
                  <value>#11011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011100</name>
                  <description>AFE Channel 0 conversion complete</description>
                  <value>#11100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011101</name>
                  <description>AFE Channel 1 conversion complete</description>
                  <value>#11101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011110</name>
                  <description>AFE Channel 2 conversion complete</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011111</name>
                  <description>AFE Channel 3 conversion complete</description>
                  <value>#11111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100000</name>
                  <description>DMA Done Signal</description>
                  <value>#100000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
